; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=300, out_folder=./training, instance_id=60, seed=2084, goal_proportion=0.03

(define (problem blocksworld-60)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 - object)
 (:init 
    (arm-empty)
    (clear b137)
    (on b137 b32)
    (on-table b32)
    (clear b112)
    (on-table b112)
    (clear b193)
    (on b193 b47)
    (on b47 b300)
    (on b300 b238)
    (on b238 b171)
    (on b171 b92)
    (on b92 b290)
    (on b290 b152)
    (on b152 b297)
    (on b297 b11)
    (on b11 b146)
    (on b146 b257)
    (on b257 b242)
    (on-table b242)
    (clear b188)
    (on-table b188)
    (clear b157)
    (on b157 b210)
    (on b210 b299)
    (on-table b299)
    (clear b12)
    (on b12 b63)
    (on b63 b216)
    (on-table b216)
    (clear b197)
    (on b197 b156)
    (on-table b156)
    (clear b104)
    (on-table b104)
    (clear b110)
    (on b110 b142)
    (on b142 b243)
    (on b243 b108)
    (on b108 b279)
    (on-table b279)
    (clear b224)
    (on b224 b217)
    (on b217 b293)
    (on b293 b89)
    (on b89 b36)
    (on-table b36)
    (clear b70)
    (on b70 b165)
    (on-table b165)
    (clear b185)
    (on-table b185)
    (clear b34)
    (on-table b34)
    (clear b37)
    (on-table b37)
    (clear b158)
    (on b158 b66)
    (on b66 b29)
    (on b29 b10)
    (on b10 b200)
    (on-table b200)
    (clear b269)
    (on b269 b75)
    (on b75 b147)
    (on b147 b50)
    (on b50 b26)
    (on-table b26)
    (clear b105)
    (on b105 b229)
    (on b229 b17)
    (on b17 b85)
    (on b85 b254)
    (on b254 b90)
    (on b90 b167)
    (on b167 b141)
    (on b141 b51)
    (on-table b51)
    (clear b135)
    (on b135 b78)
    (on b78 b1)
    (on b1 b2)
    (on b2 b33)
    (on-table b33)
    (clear b237)
    (on b237 b285)
    (on b285 b170)
    (on b170 b253)
    (on-table b253)
    (clear b163)
    (on b163 b286)
    (on b286 b283)
    (on-table b283)
    (clear b154)
    (on b154 b291)
    (on b291 b213)
    (on b213 b149)
    (on b149 b124)
    (on b124 b195)
    (on b195 b98)
    (on b98 b94)
    (on b94 b74)
    (on b74 b272)
    (on b272 b221)
    (on b221 b209)
    (on b209 b192)
    (on-table b192)
    (clear b13)
    (on b13 b48)
    (on b48 b225)
    (on b225 b265)
    (on b265 b41)
    (on b41 b239)
    (on b239 b203)
    (on b203 b244)
    (on b244 b208)
    (on b208 b20)
    (on b20 b88)
    (on b88 b207)
    (on b207 b274)
    (on-table b274)
    (clear b43)
    (on b43 b206)
    (on b206 b82)
    (on-table b82)
    (clear b175)
    (on b175 b76)
    (on b76 b73)
    (on b73 b52)
    (on-table b52)
    (clear b15)
    (on-table b15)
    (clear b284)
    (on-table b284)
    (clear b7)
    (on-table b7)
    (clear b219)
    (on-table b219)
    (clear b45)
    (on b45 b23)
    (on b23 b143)
    (on-table b143)
    (clear b119)
    (on b119 b211)
    (on-table b211)
    (clear b140)
    (on b140 b84)
    (on-table b84)
    (clear b107)
    (on b107 b14)
    (on b14 b248)
    (on b248 b292)
    (on-table b292)
    (clear b176)
    (on-table b176)
    (clear b38)
    (on-table b38)
    (clear b233)
    (on b233 b151)
    (on-table b151)
    (clear b59)
    (on-table b59)
    (clear b44)
    (on b44 b214)
    (on b214 b46)
    (on-table b46)
    (clear b134)
    (on b134 b155)
    (on b155 b212)
    (on b212 b100)
    (on b100 b132)
    (on b132 b22)
    (on b22 b4)
    (on b4 b179)
    (on b179 b180)
    (on b180 b295)
    (on b295 b130)
    (on-table b130)
    (clear b145)
    (on b145 b57)
    (on-table b57)
    (clear b181)
    (on b181 b255)
    (on-table b255)
    (clear b101)
    (on-table b101)
    (clear b125)
    (on b125 b270)
    (on b270 b58)
    (on b58 b118)
    (on b118 b271)
    (on-table b271)
    (clear b194)
    (on b194 b160)
    (on b160 b8)
    (on-table b8)
    (clear b62)
    (on b62 b69)
    (on b69 b247)
    (on b247 b161)
    (on b161 b5)
    (on b5 b91)
    (on-table b91)
    (clear b64)
    (on b64 b172)
    (on-table b172)
    (clear b54)
    (on b54 b268)
    (on b268 b97)
    (on b97 b204)
    (on b204 b245)
    (on b245 b81)
    (on-table b81)
    (clear b227)
    (on b227 b250)
    (on b250 b127)
    (on b127 b6)
    (on b6 b139)
    (on b139 b215)
    (on b215 b232)
    (on b232 b53)
    (on b53 b18)
    (on-table b18)
    (clear b236)
    (on b236 b169)
    (on-table b169)
    (clear b231)
    (on-table b231)
    (clear b122)
    (on b122 b106)
    (on b106 b111)
    (on-table b111)
    (clear b65)
    (on b65 b259)
    (on b259 b31)
    (on b31 b198)
    (on b198 b159)
    (on-table b159)
    (clear b72)
    (on b72 b120)
    (on b120 b68)
    (on b68 b28)
    (on b28 b16)
    (on b16 b252)
    (on-table b252)
    (clear b150)
    (on-table b150)
    (clear b42)
    (on b42 b235)
    (on b235 b117)
    (on b117 b294)
    (on b294 b281)
    (on b281 b71)
    (on b71 b273)
    (on-table b273)
    (clear b218)
    (on-table b218)
    (clear b86)
    (on-table b86)
    (clear b30)
    (on b30 b96)
    (on b96 b261)
    (on b261 b183)
    (on-table b183)
    (clear b114)
    (on b114 b240)
    (on b240 b40)
    (on b40 b262)
    (on b262 b230)
    (on b230 b220)
    (on b220 b174)
    (on b174 b128)
    (on-table b128)
    (clear b168)
    (on b168 b3)
    (on b3 b289)
    (on b289 b49)
    (on b49 b184)
    (on-table b184)
    (clear b222)
    (on-table b222)
    (clear b258)
    (on b258 b21)
    (on b21 b162)
    (on-table b162)
    (clear b187)
    (on b187 b190)
    (on b190 b296)
    (on-table b296)
    (clear b287)
    (on-table b287)
    (clear b260)
    (on b260 b267)
    (on b267 b102)
    (on b102 b277)
    (on-table b277)
    (clear b80)
    (on b80 b67)
    (on b67 b126)
    (on b126 b228)
    (on b228 b55)
    (on-table b55)
    (clear b205)
    (on b205 b256)
    (on b256 b136)
    (on-table b136)
    (clear b182)
    (on b182 b19)
    (on b19 b25)
    (on b25 b60)
    (on b60 b77)
    (on b77 b196)
    (on b196 b226)
    (on b226 b27)
    (on b27 b9)
    (on b9 b129)
    (on b129 b61)
    (on b61 b186)
    (on b186 b164)
    (on b164 b115)
    (on b115 b35)
    (on-table b35)
    (clear b264)
    (on-table b264)
    (clear b173)
    (on b173 b99)
    (on-table b99)
    (clear b123)
    (on b123 b278)
    (on b278 b93)
    (on-table b93)
    (clear b113)
    (on b113 b282)
    (on b282 b87)
    (on-table b87)
    (clear b276)
    (on-table b276)
    (clear b133)
    (on b133 b116)
    (on-table b116)
    (clear b234)
    (on b234 b39)
    (on b39 b249)
    (on b249 b263)
    (on-table b263)
    (clear b103)
    (on b103 b131)
    (on-table b131)
    (clear b191)
    (on-table b191)
    (clear b199)
    (on-table b199)
    (clear b121)
    (on b121 b178)
    (on b178 b148)
    (on-table b148)
    (clear b177)
    (on b177 b246)
    (on-table b246)
    (clear b138)
    (on b138 b153)
    (on-table b153)
    (clear b275)
    (on b275 b280)
    (on b280 b83)
    (on-table b83)
    (clear b189)
    (on-table b189)
    (clear b79)
    (on b79 b266)
    (on b266 b251)
    (on b251 b288)
    (on b288 b95)
    (on-table b95)
    (clear b56)
    (on-table b56)
    (clear b24)
    (on b24 b202)
    (on b202 b241)
    (on b241 b109)
    (on b109 b201)
    (on b201 b298)
    (on b298 b166)
    (on-table b166)
    (clear b144)
    (on b144 b223)
    (on-table b223))
 (:goal  (and 
    (clear b3)
    (on b3 b6)
    (on b6 b1)
    (on b1 b2)
    (on b2 b4)
    (on b4 b8)
    (on b8 b5)
    (on b5 b7)
    (on b7 b9)
    (on-table b9))))

; plan
1. (unstack b134 b155)
   deleted: (on b134 b155) (clear b134) (arm-empty)
   added: (holding b134) (clear b155)
   goals met: 1 of 10
2. (putdown b134)
   deleted: (holding b134)
   added: (clear b134) (arm-empty) (on-table b134)
   goals met: 1 of 10
3. (unstack b135 b78)
   deleted: (on b135 b78) (clear b135) (arm-empty)
   added: (holding b135) (clear b78)
   goals met: 1 of 10
4. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 1 of 10
5. (unstack b155 b212)
   deleted: (on b155 b212) (clear b155) (arm-empty)
   added: (holding b155) (clear b212)
   goals met: 1 of 10
6. (putdown b155)
   deleted: (holding b155)
   added: (clear b155) (arm-empty) (on-table b155)
   goals met: 1 of 10
7. (unstack b168 b3)
   deleted: (on b168 b3) (clear b168) (arm-empty)
   added: (holding b168) (clear b3)
   goals met: 2 of 10
8. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 2 of 10
9. (unstack b182 b19)
   deleted: (on b182 b19) (clear b182) (arm-empty)
   added: (holding b182) (clear b19)
   goals met: 2 of 10
10. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 2 of 10
11. (unstack b19 b25)
   deleted: (on b19 b25) (clear b19) (arm-empty)
   added: (holding b19) (clear b25)
   goals met: 2 of 10
12. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 2 of 10
13. (unstack b194 b160)
   deleted: (on b194 b160) (clear b194) (arm-empty)
   added: (holding b194) (clear b160)
   goals met: 2 of 10
14. (putdown b194)
   deleted: (holding b194)
   added: (clear b194) (arm-empty) (on-table b194)
   goals met: 2 of 10
15. (unstack b160 b8)
   deleted: (on b160 b8) (clear b160) (arm-empty)
   added: (holding b160) (clear b8)
   goals met: 2 of 10
16. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 2 of 10
17. (unstack b212 b100)
   deleted: (on b212 b100) (clear b212) (arm-empty)
   added: (holding b212) (clear b100)
   goals met: 2 of 10
18. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 2 of 10
19. (unstack b100 b132)
   deleted: (on b100 b132) (clear b100) (arm-empty)
   added: (holding b100) (clear b132)
   goals met: 2 of 10
20. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 2 of 10
21. (unstack b132 b22)
   deleted: (on b132 b22) (clear b132) (arm-empty)
   added: (holding b132) (clear b22)
   goals met: 2 of 10
22. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 2 of 10
23. (unstack b22 b4)
   deleted: (on b22 b4) (clear b22) (arm-empty)
   added: (holding b22) (clear b4)
   goals met: 2 of 10
24. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 2 of 10
25. (unstack b227 b250)
   deleted: (on b227 b250) (clear b227) (arm-empty)
   added: (holding b227) (clear b250)
   goals met: 2 of 10
26. (putdown b227)
   deleted: (holding b227)
   added: (clear b227) (arm-empty) (on-table b227)
   goals met: 2 of 10
27. (unstack b25 b60)
   deleted: (on b25 b60) (clear b25) (arm-empty)
   added: (holding b25) (clear b60)
   goals met: 2 of 10
28. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 2 of 10
29. (unstack b250 b127)
   deleted: (on b250 b127) (clear b250) (arm-empty)
   added: (holding b250) (clear b127)
   goals met: 2 of 10
30. (putdown b250)
   deleted: (holding b250)
   added: (clear b250) (arm-empty) (on-table b250)
   goals met: 2 of 10
31. (unstack b127 b6)
   deleted: (on b127 b6) (clear b127) (arm-empty)
   added: (holding b127) (clear b6)
   goals met: 2 of 10
32. (putdown b127)
   deleted: (holding b127)
   added: (clear b127) (arm-empty) (on-table b127)
   goals met: 2 of 10
33. (unstack b60 b77)
   deleted: (on b60 b77) (clear b60) (arm-empty)
   added: (holding b60) (clear b77)
   goals met: 2 of 10
34. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 2 of 10
35. (unstack b62 b69)
   deleted: (on b62 b69) (clear b62) (arm-empty)
   added: (holding b62) (clear b69)
   goals met: 2 of 10
36. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 2 of 10
37. (unstack b69 b247)
   deleted: (on b69 b247) (clear b69) (arm-empty)
   added: (holding b69) (clear b247)
   goals met: 2 of 10
38. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 2 of 10
39. (unstack b247 b161)
   deleted: (on b247 b161) (clear b247) (arm-empty)
   added: (holding b247) (clear b161)
   goals met: 2 of 10
40. (putdown b247)
   deleted: (holding b247)
   added: (clear b247) (arm-empty) (on-table b247)
   goals met: 2 of 10
41. (unstack b161 b5)
   deleted: (on b161 b5) (clear b161) (arm-empty)
   added: (holding b161) (clear b5)
   goals met: 2 of 10
42. (putdown b161)
   deleted: (holding b161)
   added: (clear b161) (arm-empty) (on-table b161)
   goals met: 2 of 10
43. (unstack b77 b196)
   deleted: (on b77 b196) (clear b77) (arm-empty)
   added: (holding b77) (clear b196)
   goals met: 2 of 10
44. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 2 of 10
45. (unstack b196 b226)
   deleted: (on b196 b226) (clear b196) (arm-empty)
   added: (holding b196) (clear b226)
   goals met: 2 of 10
46. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 2 of 10
47. (unstack b226 b27)
   deleted: (on b226 b27) (clear b226) (arm-empty)
   added: (holding b226) (clear b27)
   goals met: 2 of 10
48. (putdown b226)
   deleted: (holding b226)
   added: (clear b226) (arm-empty) (on-table b226)
   goals met: 2 of 10
49. (unstack b27 b9)
   deleted: (on b27 b9) (clear b27) (arm-empty)
   added: (holding b27) (clear b9)
   goals met: 2 of 10
50. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 2 of 10
51. (unstack b9 b129)
   deleted: (on b9 b129) (clear b9) (arm-empty)
   added: (holding b9) (clear b129)
   goals met: 2 of 10
52. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 10
53. (unstack b78 b1)
   deleted: (on b78 b1) (clear b78) (arm-empty)
   added: (holding b78) (clear b1)
   goals met: 3 of 10
54. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 3 of 10
55. (unstack b4 b179)
   deleted: (on b4 b179) (clear b4) (arm-empty)
   added: (holding b4) (clear b179)
   goals met: 3 of 10
56. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 4 of 10
57. (unstack b5 b91)
   deleted: (on b5 b91) (clear b5) (arm-empty)
   added: (holding b5) (clear b91)
   goals met: 4 of 10
58. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 5 of 10
59. (unstack b6 b139)
   deleted: (on b6 b139) (clear b6) (arm-empty)
   added: (holding b6) (clear b139)
   goals met: 5 of 10
60. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 6 of 10
61. (unstack b3 b289)
   deleted: (on b3 b289) (clear b3) (arm-empty)
   added: (holding b3) (clear b289)
   goals met: 5 of 10
62. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 7 of 10
63. (unstack b5 b7)
   deleted: (on b5 b7) (clear b5) (arm-empty)
   added: (holding b5) (clear b7)
   goals met: 6 of 10
64. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 10
65. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 6 of 10
66. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 7 of 10
67. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 7 of 10
68. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 8 of 10
69. (unstack b4 b8)
   deleted: (on b4 b8) (clear b4) (arm-empty)
   added: (holding b4) (clear b8)
   goals met: 7 of 10
70. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 7 of 10
71. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 7 of 10
72. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 8 of 10
73. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 8 of 10
74. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 9 of 10
75. (unstack b3 b6)
   deleted: (on b3 b6) (clear b3) (arm-empty)
   added: (holding b3) (clear b6)
   goals met: 7 of 10
76. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 8 of 10
77. (unstack b6 b1)
   deleted: (on b6 b1) (clear b6) (arm-empty)
   added: (holding b6) (clear b1)
   goals met: 7 of 10
78. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 7 of 10
79. (unstack b1 b2)
   deleted: (on b1 b2) (clear b1) (arm-empty)
   added: (holding b1) (clear b2)
   goals met: 6 of 10
80. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 6 of 10
81. (unstack b2 b33)
   deleted: (on b2 b33) (clear b2) (arm-empty)
   added: (holding b2) (clear b33)
   goals met: 6 of 10
82. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 7 of 10
83. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 10
84. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 8 of 10
85. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 10
86. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 9 of 10
87. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 8 of 10
88. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 10 of 10
